import {Component, OnInit} from "@angular/core";

class Row{
    constructor(
        public title: string,
        public price: string,
        public weight: string
    ){}
}

class Table{
    constructor(
        public theadTitle: string[],
        public tbodyData: string[]
    ){};
}
@Component({
    selector: 'lavsan-component',
    templateUrl: 'app/html/products/engineering-plastic/lavsan.component.html'
})

export class LavsanComponent implements OnInit{
    public tablePlate:Row[];
    public tableRods: Row[];
    public mechanicalPropertiesTitle: string[];
    public thermalProperties: Table;
    public thermalPropertiesTable2: Table;
    public electricalPropertiesTable: Table;
    constructor(){}

    public ngOnInit(){
        this.tablePlate = [
            new Row("Лавсан плита 10х500х2000 Полиэтилен терефталат",	"2058,08",	"15,20"),
            new Row("Лавсан плита 15х500х2000 Полиэтилен терефталат","3114,20","23,00"),
            new Row("Лавсан плита 20х500х2000 Полиэтилен терефталат","4116,16","30,40"),
            new Row("Лавсан плита 25х500х2000 Полиэтилен терефталат","5036,88","37,20"),
            new Row("Лавсан плита 30х500х2000 Полиэтилен терефталат","6160,70","45,50"),
            new Row("Лавсан плита 40х500х2000 Полиэтилен терефталат","8191,70","60,50"),
            new Row("Лавсан плита 50х500х2000 Полиэтилен терефталат","10087,30","74,50"),
            new Row("Лавсан плита 60х500х2000 Полиэтилен терефталат","11982,90","88,50")
        ];
        this.tableRods = [
            new Row("Лавсан пруток 20х1000 Полиэтилен терефталат","81,07","0,50"),
            new Row("Лавсан пруток 25х1000 Полиэтилен терефталат","116,75","0,72"),
            new Row("Лавсан пруток 30х1000 Полиэтилен терефталат","181,61","1,12"),
            new Row("Лавсан пруток 35х1000 Полиэтилен терефталат","227,00","1,40"),
            new Row("Лавсан пруток 40х1000 Полиэтилен терефталат","303,22","1,87"),
            new Row("Лавсан пруток 45х1000 Полиэтилен терефталат","377,81","2,33"),
            new Row("Лавсан пруток 50х1000 Полиэтилен терефталат"," 470,24","2,90"),
            new Row("Лавсан пруток 55х1000 Полиэтилен терефталат  ","  559,42","3,45"),
            new Row("Лавсан пруток 60х1000 Полиэтилен терефталат","648,60","4,00"),
            new Row("Лавсан пруток 65х1000 Полиэтилен терефталат"," 794,53","4,90"),
            new Row("Лавсан пруток 70х1000 Полиэтилен терефталат"," 924,25","5,70"),
            new Row("Лавсан пруток 75х1000 Полиэтилен терефталат"," 1070,19","6,60"),
            new Row("Лавсан пруток 80х1000 Полиэтилен терефталат"," 1216,13","7,50"),
            new Row("Лавсан пруток 90х1000 Полиэтилен терефталат"," 1514,48","9,34"),
            new Row("Лавсан пруток 100х1000 Полиэтилен терефталат"," 1832,30","11,30"),
            new Row("Лавсан пруток 110х1000 Полиэтилен терефталат"," 2696,27","14,30"),
            new Row("Лавсан пруток 120х1000 Полиэтилен терефталат"," 3129,93","16,60"),
            new Row("Лавсан пруток 135х1000 Полиэтилен терефталат"," 3808,70","20,20"),
            new Row("Лавсан пруток 150х1000 Полиэтилен терефталат"," 5185,12","27,50"),
            new Row("Лавсан пруток 175х1000 Полиэтилен терефталат"," 6750,10","35,80"),
            new Row("Лавсан пруток 200х1000 Полиэтилен терефталат"," 8541,31","45,30")
        ];

        this.mechanicalPropertiesTitle = [
            "Растягивающее напряжение на выходе при разрыв",
            "Удлинение при разрыве",
            "Коэффициент растяжения эластичност",
            "Испытание на сжатие 1% напряжение 1000 час.",
            "Ударная вязкость по Шарпи 7,5 Дж",
            "Испытания на удар образца с надрезом (Шарпи), (КДж/м2 )",
            "Определение твердости вдавливанием шарика, (Н/мм2)",
            "Твердость по Роквеллу (сухой)",
            "Коэффициент трения со сталью",
        ];

        this.thermalProperties = new Table(
            [
                "Температур плавления (ºС)",
                "Тепло-проводность (Вт/км)",
                "Деформация при температуре тепловой деформации (ºС)",
                "Коэффициент линейного расширения при 23-60ºС",
                "Постоянная рабочая температура(ºС)"
            ],
            [
                "255",	"0,28",	"95","70","115"
            ]
        );

        this.thermalPropertiesTable2 = new Table(
            [
               "Рабочая температура короткого периода – без нагрузки (ºС)",
                "Минимальная рабочая температура (ºС)",
                "Воспламеняемость UL 94 (толщина 3-6 мм) (%)",
                "Кислородный индекс",
                "-"
            ],
            [
                "170",	"-20","HB","22"
            ]
        );

        this.electricalPropertiesTable = new Table(
            [

                "Диэлектрическая константа при 1МГц (кВ/мм)",
                "Электрическая прочность диэлектрика",
                "Объемное удельное сопротивление",
                "Коэффициент рассеяния тангенс потерь при 1 МГц"
            ],
            [
                "3,2","60","1016","0,01"
            ]
        );
    }
}
