import {Component, OnInit} from "@angular/core";

class Row{
    constructor(
        public _1: string,
        public _2: string
    ){}
}

class TableRow{
    constructor(
        public title: string,
        public price: string,
        public weight: string
    ){};
}

@Component({
    selector: 'polypropylene-component',
    templateUrl: 'app/html/products/engineering-plastic/polypropylene.component.html'
})

export class PolypropyleneComponent implements OnInit{

    public properties: Row[];
    public tablePlate: TableRow[];
    public tableBar: TableRow[];

    public ngOnInit(){
        this.properties = [
            new Row("Плотность, г/см3","0,90—0,91"),
            new Row("Разрушающее напряжение при растяжении, кгс/см2	","250—400"),
            new Row("Относительное удлинение при разрыве,%	","200—800"),
            new Row("Модуль упругости при изгибе, кгс ","6700—11900"),
            new Row("Предел текучести при растяжении, кгс/см2","	250—350"),
            new Row("Относительно удлинение при пределе текучести,%	","10—20"),
            new Row("дарная вязкость с надрезом, кгс·см/см2","	33—80"),
            new Row("Твердость по Бринеллю, кгс/мм2	","6,0—6,5"),
        ];

        this.tablePlate = [
            new TableRow("Полипропилен лист 3х1000х2000 серый	","354,75	","5,50"),
            new TableRow("Полипропилен лист 3х1500х3000 серый	","799,80	","12,40"),
            new TableRow("Полипропилен лист 4х1000х2000 серый	","472,78	","7,33"),
            new TableRow("Полипропилен лист 4х1000х3000 серый	","712,00	","11,04"),
            new TableRow("Полипропилен лист 4х1500х3000 серый	","1062,30	","16,47"),
            new TableRow("Полипропилен лист 5х1500х3000 голубой	","1335,15	","20,70"),
            new TableRow("Полипропилен лист 5х1500х3000 серый	","1494,66	","20,70"),
            new TableRow("Полипропилен лист 6х1500х3000 голубой	","1602,80	","24,85"),
            new TableRow("Полипропилен лист 6х1500х3000 серый	","1793,60	","24,85"),
            new TableRow("Полипропилен лист 8х1500х3000 серый	","2136,90	","33,13"),
            new TableRow("Полипропилен лист т10х1500х3000 серый	","2656,10	","41,18"),
            new TableRow("Полипропилен лист т12х1500х3000 серый	","3181,77	","49,33"),
            new TableRow("Полипропилен лист т15х1500х3000 серый	","3998,98	","62,00"),
            new TableRow("Полипропилен лист т20х1500х3000 серый	","5310,27	","82,33")
        ];

        this.tableBar = [
            new TableRow("Сварочный пруток 3 мм серый	","495,00грн/бухта	","Вес 5 кг"),
            new TableRow("Сварочный пруток 4 мм серый	","525,00грн/бухта	","Вес 5 кг"),
            new TableRow("Сварочный пруток 4мм голубой	","570,00грн/бухта	","Вес 5 кг"),
            new TableRow("Полипропилен пруток 20х1000 серый	","65,00	","0,32"),
            new TableRow("Полипропилен пруток 25х1000 серый	","65,00	","0,50"),
            new TableRow("Полипропилен пруток 30х1000 серый	","65,00	","0,70"),
            new TableRow("Полипропилен пруток 35х1000 серый	","65,00	","1,00"),
            new TableRow("Полипропилен пруток 40х1000 серый	","65,00	","1,30"),
            new TableRow("Полипропилен пруток 45х1000 серый	","65,00	","1,60"),
            new TableRow("Полипропилен пруток 50х1000 серый	","65,00	","1,90"),
            new TableRow("Полипропилен пруток 55х1000 серый	","65,00	","2,40"),
            new TableRow("Полипропилен пруток 60х1000 серый	","65,00	","2,80"),
            new TableRow("Полипропилен пруток 65х1000 серый	","65,00	","3,40"),
            new TableRow("Полипропилен пруток 70х1000 серый	","65,00	","3,80"),
            new TableRow("Полипропилен пруток 75х1000 серый	","65,00	","4,30"),
            new TableRow("Полипропилен пруток 80х1000 серый	","65,00	","4,90"),
            new TableRow("Полипропилен пруток 85х1000 серый	","65,00	","5,60"),
            new TableRow("Полипропилен пруток 90х1000 серый	","65,00	","6,30"),
            new TableRow("Полипропилен пруток 95х1000 серый	","65,00	","7,05"),
            new TableRow("Полипропилен пруток 100х1000 серый	","65,00	","7,80"),
            new TableRow("Полипропилен пруток 110х1000 серый	","65,00	","9,60"),
            new TableRow("Полипропилен пруток 120х1000 серый	","65,00	","11,50"),
            new TableRow("Полипропилен пруток 130х1000 серый	","65,00	","13,50")
        ];
    }
}
