import {Component, OnInit} from "@angular/core";

class TableRow{
    constructor(
        public title: string,
        public price: string,
        public weight: string
    ){};
}

class PropertiesTable{
    constructor(
      public titles: string[],
      public data: string[]
    ){}
}
@Component({
    selector: 'polyacetal-component',
    templateUrl: 'app/html/products/engineering-plastic/polyacetal.component.html'
})

export class PolyacetalComponent implements OnInit{
    public tableSheet: TableRow[];
    public tablePlate: TableRow[];
    public tableBar: TableRow[];
    public tableTube: TableRow[];
    public mechanicalTable: PropertiesTable;
    public thermalTable: PropertiesTable;
    public electricalTable: PropertiesTable;

    public ngOnInit(){
       this.tableSheet = [
           new TableRow("Полиацеталь лист 2х1000х2000 C","175,00","5,80"),
           new TableRow("Полиацеталь лист 3х1000х2000 C","175,00","8,70"),
           new TableRow("Полиацеталь лист 4х1000х2000 C","175,00","11,60"),
           new TableRow("Полиацеталь лист 5х1000х2000 C","175,00","14,50"),
           new TableRow("Полиацеталь лист 6х1000х2000 C","175,00","17,45"),
           new TableRow("Полиацеталь лист 8х1000х2000 C","140,00","24,70"),
       ];

        this.tablePlate = [
            new TableRow("Полиацеталь плита 10x1000х2000 C","140,00","30,60"),
            new TableRow("Полиацеталь плита 12x1000х2000 C","140,00","37,40"),
            new TableRow("Полиацеталь плита 15x1000х2000 C","140,00","47,00"),
            new TableRow("Полиацеталь плита 20x1000х2000 C","140,00","61,00"),
            new TableRow("Полиацеталь плита 25х1000х2000 C","130,00","73,50"),
            new TableRow("Полиацеталь плита 30х1000х2000 C","130,00", "92,50"),
            new TableRow("Полиацеталь плита 40х1000х2000 C","130,00","122,50"),
            new TableRow("Полиацеталь плита 50х1000х2000 C","130,00","154,00"),
            new TableRow("Полиацеталь плита 60х1000х2000 C","130,00","177,00"),
            new TableRow("Полиацеталь плита 60х620х2000 С","130,00","111,60"),
            new TableRow("Полиацеталь плита 70х620х2000 С","130,00","129,00"),
            new TableRow("Полиацеталь плита 80х620х2000 С","130,00","140,00"),
            new TableRow("Полиацеталь плита 100х620х2000 С","130,00","185,00")
        ];

        this.tableBar = [
            new TableRow("Полиацеталь пруток  8х1000 С","10,77","0,085"),
            new TableRow("Полиацеталь пруток 10х1000 C","14,88","0,125"),
            new TableRow("Полиацеталь пруток 10х1000 C черный","14,88","0,125"),
            new TableRow("Полиацеталь пруток 12х1000 C","23,43","0,185"),
            new TableRow("Полиацеталь пруток 12х1000 C черный","23,43","0,185"),
            new TableRow("Полиацеталь пруток 15х1000 С","33,09","0,270"),
            new TableRow("Полиацеталь пруток 15х1000 С черный","33,09","0,270"),
            new TableRow("Полиацеталь пруток 16х1000 C","37,94","0,300"),
            new TableRow("Полиацеталь пруток 16х1000 C черный","37,94","0,300"),
            new TableRow("Полиацеталь пруток 20х1000 C черный","58,15","0,460"),
            new TableRow("Полиацеталь пруток 20х1000 С","58,15","0,460"),
            new TableRow("Полиацеталь пруток 22х1000 C черный","70,80","0,560"),
            new TableRow("Полиацеталь пруток 25х1000 C","93,55","0,750"),
            new TableRow("Полиацеталь пруток 25х1000 C черный","93,55","0,750"),
            new TableRow("Полиацеталь пруток 30х1000 С","132,72","1,050"),
            new TableRow("Полиацеталь пруток 30х1000 С черный","132,72","1,050"),
            new TableRow("Полиацеталь пруток 35х1000 C черный","180,76","1,490"),
            new TableRow("Полиацеталь пруток 35х1000 С","180,76","1,490"),
            new TableRow("Полиацеталь пруток 40х1000 С","233,85","1,900"),
            new TableRow("Полиацеталь пруток 40х1000 С черный","233,85","1,900"),
            new TableRow("Полиацеталь пруток 45х1000 C черный","297,05","2,300"),
            new TableRow("Полиацеталь пруток 45х1000 С","297,05","2,300"),
            new TableRow("Полиацеталь пруток 50х1000 C","320,62","2,850"),
            new TableRow("Полиацеталь пруток 50х1000 C черный","333,45","2,850"),
            new TableRow("Полиацеталь пруток 55х1000 C","393,74","3,500"),
            new TableRow("Полиацеталь пруток 55х1000 C черный","410,25","3,500"),
            new TableRow("Полиацеталь пруток 60х1000 C","472,50","4,200"),
            new TableRow("Полиацеталь пруток 60х1000 C черный","491,40","4,200"),
            new TableRow("Полиацеталь пруток 65х1000 C","540,00","4,800"),
            new TableRow("Полиацеталь пруток 70х1000 C","626,63","5,570"),
            new TableRow("Полиацеталь пруток 70х1000 C черный","651,70","5,570"),
            new TableRow("Полиацеталь пруток 75х1000 C","745,00","6,500"),
            new TableRow("Полиацеталь пруток 75х1000 C черный","760,50","6,500"),
            new TableRow("Полиацеталь пруток 80х1000 C","832,50","7,400"),
            new TableRow("Полиацеталь пруток 80х1000 C черный","865,80","7,400"),
            new TableRow("Полиацеталь пруток 85х1000 C","952,00","8,400"),
            new TableRow("Полиацеталь пруток 85х1000 C черный","982,80","8,400"),
            new TableRow("Полиацеталь пруток 90х1000 C","1057,50","9,400"),
            new TableRow("Полиацеталь пруток 90х1000 C черный","1099,80","9,400"),
            new TableRow("Полиацеталь пруток 100х1000 C","1035,00","11,600"),
            new TableRow("Полиацеталь пруток 100х1000 C черный","1357,20","11,600"),
            new TableRow("Полиацеталь пруток 110х1000 С","1597,50","14,200"),
            new TableRow("Полиацеталь пруток 110х1000 С черный","1661,40","14,200"),
            new TableRow("Полиацеталь пруток 120х1000 C","2823,45","17,500"),
            new TableRow("Полиацеталь пруток 120х1000 C черный","2823,45","17,500"),
            new TableRow("Полиацеталь пруток 130x1000 С	","3226,80","20,000"),
            new TableRow("Полиацеталь пруток 130x1000 С черный","3226,80","20,000"),
            new TableRow("Полиацеталь пруток 140х1000 С	","3856,00","23,900"),
            new TableRow("Полиацеталь пруток 150х1000 C	","4194,84","26,000"),
            new TableRow("Полиацеталь пруток 150х1000 C черный","4194,84","26,000"),
            new TableRow("Полиацеталь пруток 160х1000 C	","4920,87","30,500"),
            new TableRow("Полиацеталь пруток 175х1000 C	 ","5969,58","37,000"),
            new TableRow("Полиацеталь пруток 180х1000 С	 ","6292,26","39,000"),
            new TableRow("Полиацеталь пруток 200х1000 C	 ","7421,64","46,000"),
            new TableRow("Полиацеталь пруток 235х1000 C	 ","10406,43","64,500"),
            new TableRow("Полиацеталь пруток 250х1000 С 	 ","12100,50","75,000"),
            new TableRow("Полиацеталь пруток 300х1000 С 	 ","16860,00","104,500")
        ];

        this.tableTube = [
            new TableRow("Полиацеталь труба 60х30х1000 C","Договорная","3,30"),
            new TableRow("Полиацеталь труба 70x30х1000 C","Договорная","4,50"),
            new TableRow("Полиацеталь труба 80х30х1000 C","Договорная","6,50"),
            new TableRow("Полиацеталь труба 90х30х1000 С","Договорная","8,00"),
            new TableRow("Полиацеталь труба 100х30х1000 С","Договорная","9,70"),
            new TableRow("Полиацеталь труба 110х60х1000 С","Договорная","10,80"),
            new TableRow("Полиацеталь труба 120х50х1000 С","Договорная","12,30")
        ];

        this.mechanicalTable = new PropertiesTable(
            [
                "Растягивающее напряжение на выходе при разрыве (Н/мм2)",
                "Удлинение при разрыве (%)",
                "Коэффициент растяжения эластичности (Н/мм2)",
                "Испытание на сжатие 1% напряжение 1000 час. (Н/мм2)",
                "Ударная вязкость по Шарпи 7,5 Дж (КДж/м2 )",
                "Испытания на удар образца с надрезом (Шарпи), (КДж/м2 )",
                "Определение твердости вдавливанием шарика, (Н/мм2)",
                "Твердость по Роквеллу (сухой)",
                "Коэффициент трения со сталью"
            ],
            ["66","50","2700","14","n.b.","9","140","M88","0,30"]
        );

        this.thermalTable = new PropertiesTable([
            "Температура плавления",
            "Тепло-проводность, (Вт/км)",
            "Деформация при температуре тепловой деформации, (ºС)",
            "Коэффициент линейного расширения при 23-60ºС (10-6.К-1)",
            "Постоянная рабочая температура, (ºС)",
            "Рабочая температура короткого периода – без нагрузки, (ºС)",
            "Минимальная рабочая температура, (ºС)",
            "Воспламеняемость UL 94 (толщина 3-6 мм)",
            "Кислородный индекс, (%)"
        ],[
            "165","0,30","115","110","110","+140","-50","HB","15"
        ]);

        this.electricalTable = new PropertiesTable([
            "Диэлектрическая константа при 1МГц","" +
            "Электрическая прочность диэлектрика, (кВ/мм)",
            "Объемное удельное сопротивление, (Ом/см)",
            "Коэффициент рассеяния тангенс потерь при 1 МГц"
        ],[
            "3,8","50","10 в 15","0,01"
        ]);

    }

}



